# RoomDesignLightingLoadParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomDesignLightingLoadParam Property
ParameterTypeId Class See Also
---
"Specified Lighting Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomDesignLightingLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomDesignLightingLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomDesignLightingLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace